tutorials/testcases/freeSurface/flowOverStep/overset/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-2 0 0  )
    ( 4 0 0  )
    ( 4 1 0  )
    (-2 1 0  )
    (-2 0 0.1)
    ( 4 0 0.1)
    ( 4 1 0.1)
    (-2 1 0.1)

    (0.85 0    0  )
    (2.15 0    0  )
    (2.15 0.55 0  )
    (0.85 0.55 0  )
    (0.85 0    0.1)
    (2.15 0    0.1)
    (2.15 0.55 0.1)
    (0.85 0.55 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) background (500  80 1) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15) overset (130 55 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    fixedWalls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (8 9 13 12)
        );
    }
    slipWall
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (3 2 1 0)
            (4 5 6 7)
            (11 10 9 8)
            (12 13 14 15)
        );
    }
    inner
    {
        type bellerophon;
        donorZone upper;
        faces
        (
            (9 10 14 13)
            (8 12 15 11)
            (11 15 14 10)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
