tutorials/testcases/freeSurface/flowOverStep/overset/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          567;
        startFace       81028;
    }
    slipWall
    {
        type            patch;
        nFaces          500;
        startFace       81595;
    }
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       82095;
    }
    outlet
    {
        type            patch;
        nFaces          80;
        startFace       82175;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          81854;
        startFace       82255;
    }
    inner
    {
        type            bellerophon;
        inGroups        1(bellerophon);
        nFaces          240;
        startFace       164109;
        matchTolerance  0.0001;
        transform       unknown;
        donorZone       upper;
    }
    outer
    {
        type            bellerophon;
        inGroups        1(bellerophon);
        nFaces          185;
        startFace       164349;
        matchTolerance  0.0001;
        transform       unknown;
        donorZone       overset;
    }
)

// ************************************************************************* //
