tutorials/testcases/freeSurface/flowOverStep/overset/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{  
    "alpha.water.*"
    {
        nAlphaCorr      3; //2;
        nAlphaSubCycles 1;
        alphaOuterCorrectors yes;
        cAlpha          1;
        icAlpha		0;

        MULESCorr       yes;
        nLimiterIter    8; //3;
	//alphaApplyPrevCorr  yes;

        solver          bellerophonPBiCG;
        preconditioner  DILU;
        tolerance       1.0e-08;
        relTol          0;
    }

    pcorr
    {
        solver          bellerophonPBiCG;
        preconditioner  DILU;
        tolerance       1e-5;
        relTol          0;
    }

    p_rgh
    {
        solver          bellerophonPBiCG;
        preconditioner  DILU;
        tolerance       1.0e-06;
        relTol          1.0e-02;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          1.0e-03;
    }

    "(U|k|omega|epsilon|yPsi).*"
    {
        solver          bellerophonPBiCG;
        preconditioner  DILU;
        tolerance       1.0e-08;
        relTol          1.0e-05;
        minIter         1;
    }
}

PIMPLE
{
    nOuterCorrectors    4;
    nCorrectors         1;
    nNonOrthogonalCorrectors 0;

    residualControl
    {
        p_rgh
        {
            tolerance   1.0e-03;
            relTol 0;
        }
        U
        {
            tolerance   1.0e-05;
            relTol 0;
        }
    }
    
    //maxCo               10;
    //maxAlphaCo          5;
    
    

    //rDeltaTSmoothingCoeff 0.05;
    //rDeltaTDampingCoeff 0.5;
    //nAlphaSpreadIter    0;
    //nAlphaSweepIter     0;
    //maxDeltaT           1;
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    fields
    {
    }
    equations
    {
        ".*" 1;
    }
}

cache
{
    grad(U);
}


// ************************************************************************* //
